SharePoint/Sample Code/Console Applications/UltiProConsole/UltiProConsole/Service References/LoginService/LoginService1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://www.ultipro.com/services/loginservice" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.ultipro.com/services/loginservice" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema targetNamespace="http://www.ultipro.com/services/loginservice/Imports">
      <xsd:import schemaLocation="https://service4.ultipro.com/services/LoginService?xsd=xsd0" namespace="http://www.ultipro.com/contracts" />
      <xsd:import schemaLocation="https://service4.ultipro.com/services/LoginService?xsd=xsd2" namespace="http://www.ultipro.com/services/loginservice" />
      <xsd:import schemaLocation="https://service4.ultipro.com/services/LoginService?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="TokenRequest">
    <wsdl:part xmlns:q1="http://www.ultipro.com/contracts" name="parameters" element="q1:TokenRequest" />
  </wsdl:message>
  <wsdl:message name="TokenRequest_Headers">
    <wsdl:part name="ClientAccessKey" element="tns:ClientAccessKey" />
    <wsdl:part name="Password" element="tns:Password" />
    <wsdl:part name="UserAccessKey" element="tns:UserAccessKey" />
    <wsdl:part name="UserName" element="tns:UserName" />
  </wsdl:message>
  <wsdl:message name="TokenResponse">
    <wsdl:part xmlns:q2="http://www.ultipro.com/contracts" name="parameters" element="q2:TokenResponse" />
  </wsdl:message>
  <wsdl:portType name="ILoginService">
    <wsdl:operation name="Authenticate">
      <wsdl:input wsaw:Action="http://www.ultipro.com/services/loginservice/ILoginService/Authenticate" name="TokenRequest" message="tns:TokenRequest" />
      <wsdl:output wsaw:Action="http://www.ultipro.com/services/loginservice/ILoginService/AuthenticateResponse" name="TokenResponse" message="tns:TokenResponse" />
    </wsdl:operation>
  </wsdl:portType>
</wsdl:definitions>